Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.?

In [1]:
import pandas as pd

In [2]:
s=pd.Series([4,4,15,16,23,42],name='numbers')

In [3]:
s

0     4
1     4
2    15
3    16
4    23
5    42
Name: numbers, dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it?

In [4]:
numbers=pd.Series(list(range(1,11)))

In [5]:
numbers

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame?

In [6]:
df=pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,26],'Gender':['Female','Male','Female']})

In [7]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   26  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example?

Dataframe can be called as a collections of Series, having index values, Series is just like a one Diamensional array.

In [8]:
df=pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,26],'Gender':['Female','Male','Female']})
print('data type',type(df))
print(df.head())

data type <class 'pandas.core.frame.DataFrame'>
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   26  Female

In [9]:
series=df['Name']

In [10]:
print(type(series))
print(series)

<class 'pandas.core.series.Series'>
0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [11]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

In [12]:
# groupby(),merge(),concat(),value_counts(),describe() these are some of the examples

In [13]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [14]:
# Series and DataFrame are mutable

In [15]:
# Q7. Create a DataFrame using multiple Series. Explain with an example

In [16]:
s1=pd.Series(['Shivam','Shubham','Rahha','Abhinav'],name='Employees')

In [17]:
s2=pd.Series(['TCS','TCS','LTIM','Infy'],name='Company')

In [18]:
s3=pd.Series(['C1','C2','C2','C4'],name='Salery_grade')

In [19]:
df=pd.DataFrame({'Employees':s1,'Company':s2,'Salery_grade':s3})

In [20]:
df

  Employees Company Salery_grade
0    Shivam     TCS           C1
1   Shubham     TCS           C2
2     Rahha    LTIM           C2
3   Abhinav    Infy           C4